src/Documents/Контракт/Контракт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Контракт</name>
  <comment>Контракты, договоры, коммерческие предложения</comment>
  <registerRecords>InformationRegister.КонтрактыСЗаказчикомПоЗаявкам</registerRecords>
  <registerRecords>InformationRegister.ЦеныПредметовСнабжения</registerRecords>
  <registerRecords>InformationRegister.ТКПСЗаказчикомПоЗаявкам</registerRecords>
  <registerRecords>InformationRegister.ЦеныДЗО</registerRecords>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТоргов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияКП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ДополнительныеНаименования/ДополнительныеНаименования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеНаименования</name>
  <comment>Наименования элементов структуры заказа и предметов снабжения на иностранном языке</comment>
  <resources>
    <name>Перевод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <comment>Предмет снабжения либо элемент структуры заказа с типом &quot;Группа&quot;</comment>
    <type>
      <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      <types>CatalogRef.ХарактеристикиКораблей</types>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
      <types>CatalogRef.Флоты</types>
      <types>CatalogRef.ПроектыКораблей</types>
      <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.Языки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыКонтрактов/ВидыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрактов</name>
  <enumValues>
    <name>КонтрактСЗаказчиком</name>
  </enumValues>
  <enumValues>
    <name>КонтрактСПоставщиком</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыКонтрактов/ТипыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрактов</name>
  <enumValues>
    <name>Контракт</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>ТКП</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗапросТКПRFP/ЗапросТКПRFP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросТКПRFP</name>
  <comment>Запросы на ТКП-RFP</comment>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПодачиТКП</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресОтправкиТКП</name>
    <type>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерФСВТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииФСВТС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектаВТС</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/ИностранныеЗаказчики/ИностранныеЗаказчики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИностранныеЗаказчики</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВМС</name>
    <type>
      <types>CatalogRef.Флоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Название</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодCAGE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКонтактногоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Факс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WebСайт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Флоты/Флоты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Флоты</name>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.ОКСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Герб</name>
    <type>
      <types>CatalogRef.ФлотыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкПредставленияДанных</name>
    <type>
      <types>CatalogRef.Языки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОтображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКодовПредметовСнабженияДляОтчетов</name>
    <comment>//20.12.2017 Веденеев П. //для вывода в отчеты согласно ОПЗ 6</comment>
    <type>
      <types>EnumRef.ВидыКодовПредметовСнабженияДляОтчетов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/Контракт/Forms/ФормаКонтрактаСПоставщиком/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ 11.04.2018 Веденеев П. //разделение формы документа
	Если Параметры.Свойство("ВидКонтракта") Тогда
		
		Объект.Вид = Параметры.ВидКонтракта;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Вид) Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	//-- 11.04.2018 Веденеев П. //разделение формы документа
	
	ВидКонтрактСЗаказчиком 	= Перечисления.ВидыКонтрактов.КонтрактСЗаказчиком;
	ВидКонтрактСПоставщиком = Перечисления.ВидыКонтрактов.КонтрактСПоставщиком;
	
	ТКПСПоставщиком 	= Параметры.Свойство("ТКПСПоставщиком");
	ТКПСЗаказчиком 		= Параметры.Свойство("ТКПСЗаказчиком");
	КонтрактСЗаказчиком = Параметры.Свойство("КонтрактСЗаказчиком");
	
	Если ТКПСПоставщиком Или ТКПСЗаказчиком Или КонтрактСЗаказчиком Тогда
		
		Модифицированность = Истина;
		
		ДанныеПодбораЗаявок = ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилища);
		
		УдалитьИзВременногоХранилища(Параметры.АдресВременногоХранилища);
		
		Если ДанныеПодбораЗаявок.Свойство("Валюта") Тогда
		
			Объект.Валюта = ДанныеПодбораЗаявок.Валюта;	
		
		ИначеЕсли ДанныеПодбораЗаявок.Свойство("МассивВалют") Тогда
		
			Если ДанныеПодбораЗаявок.МассивВалют.Количество() > 0 Тогда
			
				СообщениеВалюты = "В выбранных заявках установлены валюты: " + СтрСоединить(ДанныеПодбораЗаявок.МассивВалют, ", ") + ". Необходимо установить валюту контракта вручную.";	
			
			КонецЕсли;	
		
		КонецЕсли;
		
		Если ТКПСПоставщиком Тогда
		
			Объект.Тип = Перечисления.ТипыКонтрактов.КоммерческоеПредложение;
			Объект.Вид = ВидКонтрактСПоставщиком;
			Объект.Контрагент = ДанныеПодбораЗаявок.ИсполнительДЗО;
		
		ИначеЕсли ТКПСЗаказчиком Или КонтрактСЗаказчиком Тогда
		
			Объект.Тип = ?(КонтрактСЗаказчиком, Перечисления.ТипыКонтрактов.Контракт, Перечисления.ТипыКонтрактов.ТКП);
			Объект.Вид = ВидКонтрактСЗаказчиком;
			Объект.Контрагент = ДанныеПодбораЗаявок.Заказчик;
			
			ДанныеПодбораЗаявок.ТаблицаВыбранныхПозицийЗаявок.Колонки.Найти("ЦенаОСК").Имя = "Цена";
			
		КонецЕсли;
		
		Объект.ПредметыСнабжения.Загрузить(ДанныеПодбораЗаявок.ТаблицаВыбранныхПозицийЗаявок);
	
	КонецЕсли;
	
	Если Объект.Вид = ВидКонтрактСЗаказчиком Тогда
		
		Заказчик = Объект.Контрагент;	
		
	ИначеЕсли Объект.Вид = ВидКонтрактСПоставщиком Тогда
		
		Поставщик = Объект.Контрагент;			
		
	КонецЕсли;
	
	Если Параметры.Свойство("СсылкаПС") Тогда
		
		Найдено = Объект.ПредметыСнабжения.НайтиСтроки(Новый Структура("ПредметСнабжения", Параметры.СсылкаПС));
		
		Если Найдено.Количество() > 0 Тогда
			
			Элементы.ПредметыСнабжения.ТекущаяСтрока = Найдено[0].ПолучитьИдентификатор();
			
		КонецЕсли; 
		
		
	КонецЕсли; 
	
	// + 13.03.2018 13:55:50 Базунов Д.А. Задача: 
	Если НЕ ПравоДоступа("Изменение", Метаданные.Документы.Контракт) Тогда
		Элементы.Заказчик.Доступность = Ложь;
		Элементы.ПредметыСнабженияПодбор.Доступность = Ложь;
	КонецЕсли; 
	// - 13.03.2018 13:55:50 Базунов Д.А. Задача:
	
	УстановитьВидимостьКнопокПечати();
	
	Если НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда
	//++ 27.03.2018 Веденеев П. //установка валюты по умолчанию
		УстановитьВалютуПоУмолчанию();
	//-- 27.03.2018 Веденеев П. //установка валюты по умолчанию
	КонецЕсли;

	//++ 06.04.2018 Веденеев П. //добавлен новый реквизит ТКП - ДатаЗаключенияКонтракта
	Элементы.ДатаЗаключенияКонтракта.Видимость = (Объект.Тип  = Перечисления.ТипыКонтрактов.ТКП 
		И Объект.Вид = Перечисления.ВидыКонтрактов.КонтрактСЗаказчиком);
	//-- 06.04.2018 Веденеев П. //добавлен новый реквизит ТКП - ДатаЗаключенияКонтракта
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.ОтветственноеЛицо = Константы.ОтветственноеЛицоПоКонтрактам.Получить();
		
	КонецЕсли;
	
	Элементы.ПредметыСнабженияПоказатьСкрытьТендерныеЦены.Видимость = РольДоступна("РуководительДепартаментаВТС") 
															ИЛИ РольДоступна("РуководительПроектаДепартаментаВТС") 
															ИЛИ РольДоступна("СпециалистДепартаментаЭкономикиОСК") 
															ИЛИ РольДоступна("ПолныеПрава");
КонецПроцедуры

//++ 27.03.2018 Веденеев П. //установка валюты по умолчанию
&НаСервере
Процедура УстановитьВалютуПоУмолчанию()
	
	Если ЗначениеЗаполнено(Объект.Вид) Тогда
		
		Объект.Валюта = ?(Объект.Вид = Перечисления.ВидыКонтрактов.КонтрактСПоставщиком, Константы.ОсновнаяВалюта.Получить(), Константы.ДолларСША.Получить());
		
	Иначе
		
		Объект.Валюта = Справочники.ОКВ.ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры	
//++ 27.03.2018 Веденеев П. //установка валюты по умолчанию

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьЭлементов();
	
	ЗаполнитьСрокТоргов(); 
	
	СформироватьСписокВыбораТипа();
	
	Если ЗначениеЗаполнено(СообщениеВалюты) Тогда
	
		ПоказатьПредупреждение(, СообщениеВалюты,, "Необходимо заполнить валюту вручную");	
	
	КонецЕсли;
	
	ДобавитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление()
	
	ЭлементыОформления = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементыОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ПредметыСнабжения");
	
	ГруппаОтбора = ЭлементыОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ГруппаОтбора.Использование = Истина;
	
	//ЭлементОтбора = ЭлементыОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПредметыСнабжения.ПредметСнабжения");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПредметыСнабжения.ПредметСнабженияИсходный");
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Тип");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.ТипыКонтрактов.КоммерческоеПредложение;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПредметыСнабжения.ПредметСнабженияИсходный");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ЭлементОтбора.Использование = Истина;
	
	ЭлементыОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый);
	ЭлементыОформления.Использование = Истина;
	
КонецПроцедуры	//ДобавитьУсловноеОформление

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	НастроитьВидимостьЭлементов();
	
	СформироватьСписокВыбораТипа();
	
	УстановитьВидимостьКнопокПечати();
	
	//++ 27.03.2018 Веденеев П. //установка валюты по умолчанию
	УстановитьВалютуПоУмолчанию();
	//-- 27.03.2018 Веденеев П. //установка валюты по умолчанию
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокВыбораТипа()

	Элементы.Тип.СписокВыбора.Очистить();
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыКонтрактов.ПустаяСсылка") Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Элементы.Тип.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрактов.Контракт"), "Контракт");
	Элементы.Тип.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрактов.Договор"), "Договор");
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыКонтрактов.КонтрактСЗаказчиком") Тогда
	
		Элементы.Тип.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрактов.ТКП"), "ТКП");	
	
	ИначеЕсли Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыКонтрактов.КонтрактСПоставщиком") Тогда
	
		Элементы.Тип.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыКонтрактов.КоммерческоеПредложение"), "Коммерческое предложение");
		
	КонецЕсли;	

КонецПроцедуры // СформироватьСписокВыбораТипа()

&НаКлиенте
Процедура НастроитьВидимостьЭлементов()

	Если Не ЗначениеЗаполнено(Объект.Вид) Тогда
	
		Элементы.Заказчик.Видимость 		= Ложь;
		Элементы.Поставщик.Видимость 		= Ложь;
		// ++ 29.05.2018 13:27:36 Базунов Д.А. Задача: 
		//Элементы.ДатаНачалаТоргов.Видимость = Ложь;
		//Элементы.СрокТоргов.Видимость 		= Ложь;
		// -- 29.05.2018 13:27:36 Базунов Д.А. Задача:
	
	ИначеЕсли Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыКонтрактов.КонтрактСЗаказчиком") Тогда
	
		Элементы.Заказчик.Видимость 		= Истина;
		Элементы.Поставщик.Видимость 		= Ложь;
		// ++ 29.05.2018 13:27:51 Базунов Д.А. Задача: 
		//Элементы.ДатаНачалаТоргов.Видимость = Ложь;
		//Элементы.СрокТоргов.Видимость 		= Ложь;
		// -- 29.05.2018 13:27:51 Базунов Д.А. Задача:
		
	ИначеЕсли Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыКонтрактов.КонтрактСПоставщиком") Тогда
	
		Элементы.Заказчик.Видимость 		= Ложь;
		Элементы.Поставщик.Видимость 		= Истина;
		// ++ 29.05.2018 13:27:58 Базунов Д.А. Задача: 
		//Элементы.ДатаНачалаТоргов.Видимость = Истина;
		//Элементы.СрокТоргов.Видимость 		= Истина;
		// -- 29.05.2018 13:27:58 Базунов Д.А. Задача:	
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Тип) Или Объект.Тип <> ПредопределенноеЗначение("Перечисление.ТипыКонтрактов.КоммерческоеПредложение") Тогда
		Элементы.ПредметыСнабженияКомментарий.Видимость 				= Ложь;
		//Элементы.ПредметыСнабженияПредметСнабженияИсходный.Видимость 	= Ложь;
	Иначе
		Элементы.ПредметыСнабженияКомментарий.Видимость 				= Истина;
		//Элементы.ПредметыСнабженияПредметСнабженияИсходный.Видимость 	= Истина;
	КонецЕсли;
	
КонецПроцедуры // НастроитьВидимостьЭлементов()

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ЗаполнитьСрокТоргов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаТорговПриИзменении(Элемент)
		
	ЗаполнитьСрокТоргов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСрокТоргов()

	Если ЗначениеЗаполнено(Объект.Дата) И ЗначениеЗаполнено(Объект.ДатаНачалаТоргов) Тогда
	
		СрокТоргов = Цел((Объект.ДатаНачалаТоргов - Объект.Дата) / 86400);
		
	Иначе
		
		СрокТоргов = 0;	
	
	КонецЕсли;	

КонецПроцедуры // ЗаполнитьСрокТоргов()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Вид = Перечисления.ВидыКонтрактов.КонтрактСЗаказчиком Тогда
	
		ТекущийОбъект.Контрагент = Заказчик;	
	
	ИначеЕсли ТекущийОбъект.Вид = Перечисления.ВидыКонтрактов.КонтрактСПоставщиком Тогда
	
		ТекущийОбъект.Контрагент = Поставщик;		
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыСнабженияПредметСнабженияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикВыбораПредметаСнабжения", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыборДляКонтракта");	
	
	Если ЗначениеЗаполнено(Поставщик) И Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыКонтрактов.КонтрактСПоставщиком") Тогда
	
		ПараметрыОткрытия.Вставить("Поставщик", Поставщик);	
	
	КонецЕсли;
	
	ОткрытьФорму("Справочник.КаталогПредметовСнабжения.Форма.ФормаВыбораРасширенная", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораПредметаСнабжения(ПредметСнабжения, ДопПараметры = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(ПредметСнабжения) Тогда
	
		Возврат;
	
	КонецЕсли;	
	
	ТекущиеДанные = Элементы.ПредметыСнабжения.ТекущиеДанные;
	
	ТекущиеДанные.ПредметСнабжения = ПредметСнабжения;
	// ++ 06.07.2018 11:08:56 Базунов Д.А. Задача: 
	ТекущиеДанные.ЕдиницаИзмерения = ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(ПредметСнабжения, "ЕдиницаИзмерения");
	// -- 06.07.2018 11:08:56 Базунов Д.А. Задача:

КонецПроцедуры // ОбработчикВыбораПредметаСнабжения()

&НаКлиенте
Процедура Подбор(Команда)
    
    ПараметрыФормы = Новый Структура("РежимВыбора, ЗакрыватьприВыборе, МножественныйВыбор", Истина, Ложь, Ложь);
    Форма = ПолучитьФорму("Справочник.КаталогПредметовСнабжения.ФормаСписка", ПараметрыФормы,Элементы.ПредметыСнабжения);
    Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
    Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ПредметыСнабженияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    
    Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КаталогПредметовСнабжения") Тогда
        
    Строки = Объект.ПредметыСнабжения.НайтиСтроки(Новый Структура("ПредметСнабжения", ВыбранноеЗначение));
        Если Строки.Количество() = 0 Тогда
            НоваяСтрока = Объект.ПредметыСнабжения.Добавить();
            НоваяСтрока.ПредметСнабжения = ВыбранноеЗначение;
			Элементы.ПредметыСнабжения.ТекущаяСтрока = Объект.ПредметыСнабжения.Количество()-1;
			// ++ 06.07.2018 11:08:56 Базунов Д.А. Задача: 
			НоваяСтрока.ЕдиницаИзмерения = ОбщиеФункцииСервер.ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "ЕдиницаИзмерения");
			// -- 06.07.2018 11:08:56 Базунов Д.А. Задача:
        КонецЕсли; 
            
    КонецЕсли;     
    
КонецПроцедуры

&НаКлиенте
Процедура ПредметыСнабженияЗаявкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыСнабженияЗаявкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьВидимостьКнопокПечати();
	
	НастроитьВидимостьЭлементов();
	
КонецПроцедуры

//++ 11.04.2018 Веденеев П. //добавление списков цен
&НаКлиенте
Процедура ПоказатьСкрытьВнутренниеЦены(Команда)
	
	Если Элементы.ГруппаВнутренниеЦены.Видимость Тогда
		
		Элементы.ГруппаВнутренниеЦены.Видимость = Ложь;
		Элементы.ПредметыСнабженияПоказатьСкрытьВнутренниеЦены.Пометка = Ложь;
		
	Иначе
		
		ОтобразитьЦены("ЦеныВнутренние");
		Элементы.ГруппаВнутренниеЦены.Видимость = Истина;
		Элементы.ПредметыСнабженияПоказатьСкрытьВнутренниеЦены.Пометка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыСнабженияПриАктивизацииСтроки(Элемент)
	
	ПриВыбореПредметаСнабжения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыСнабженияПредметСнабженияПриИзменении(Элемент)
	
	ПриВыбореПредметаСнабжения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметыСнабженияПослеУдаления(Элемент)
	
	ПриВыбореПредметаСнабжения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореПредметаСнабжения()
	
	Если Элементы.ГруппаВнутренниеЦены.Видимость Тогда
		
		ОтобразитьЦены("ЦеныВнутренние");
		
	КонецЕсли;
	
	Если Элементы.ГруппаТендерныеЦены.Видимость Тогда
		
		ОтобразитьЦены("ЦеныТендерные");
		
	КонецЕсли;
	
	ТедДанные = Элементы.ПредметыСнабжения.ТекущиеДанные;
	Если ТедДанные <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ТедДанные.ПредметСнабженияИсходный) Тогда
			ТедДанные.ПредметСнабженияИсходный = ТедДанные.ПредметСнабжения;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьЦены(ИмяСпискаЦен)
	
	ТекущиеДанные = Элементы.ПредметыСнабжения.ТекущиеДанные;
	ПредметСнабжения = ?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.ПредметСнабжения);
	
	ЭтаФорма[ИмяСпискаЦен].Параметры.УстановитьЗначениеПараметра("ПредметСнабжения", ПредметСнабжения);
	
КонецПроцедуры
//-- 11.04.2018 Веденеев П. //добавление списков цен

//++ 21.02.2018 Веденеев П.
#Область Печать

&НаКлиенте
Процедура ПечатьКоммерческоеПредложение(Команда)
	
	ПечатьОтчета("КоммерческоеПредложениеПоставщика", Новый Структура("КоммерческоеПредложение", Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьТехникоКоммерческоеПредложение(Команда)
		
	ПечатьОтчета("ТехникоКоммерческоеПредложение", Новый Структура("КоммерческоеПредложение", Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтчета(ИмяОтчета, Параметры)
	
	Если Не Объект.Проведен Или Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Сначала проведите документ!");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ПредметыСнабжения.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, "В документе нет ни одного предмета снабжения!");
		Возврат;
		
	КонецЕсли;
	
	РезультатОтчета = Новый ТабличныйДокумент;
	РезультатОтчета.ОтображатьЗаголовки = Ложь;
	РезультатОтчета.ОтображатьСетку = Ложь;
	
	ВывестиОтчет(РезультатОтчета, ИмяОтчета, Параметры);
	
	РезультатОтчета.Показать("");
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОтчет(ТабличныйДокумент, ИмяОтчета, Параметры)
	
	ОтчетОбъект = Отчеты[ИмяОтчета].Создать();
	
	ПараметрыОтчета = ОтчетОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	
	Для каждого Параметр Из Параметры Цикл
		
		ПараметрОтчета = ПараметрыОтчета.Найти(Параметр.Ключ);
		
		Если Не ПараметрОтчета = Неопределено Тогда
			
			ПараметрОтчета.Использование = Истина;
			ПараметрОтчета.Значение = Параметр.Значение;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОтчетОбъект.СкомпоноватьРезультат(ТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопокПечати()
	
	Элементы.ФормаПечатьКоммерческоеПредложение.Видимость = (Объект.Тип  = Перечисления.ТипыКонтрактов.КоммерческоеПредложение 
		И Объект.Вид = Перечисления.ВидыКонтрактов.КонтрактСПоставщиком);
	Элементы.ФормаПечатьТехникоКоммерческоеПредложение.Видимость = (Объект.Тип  = Перечисления.ТипыКонтрактов.ТКП 
		И Объект.Вид = Перечисления.ВидыКонтрактов.КонтрактСЗаказчиком);
	Элементы.ФормаВыгрузкаТКП.Видимость = Элементы.ФормаПечатьТехникоКоммерческоеПредложение.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаТКП(Команда)
	
	Если Не Объект.Проведен Или Модифицированность Тогда
		
		ПоказатьПредупреждение(, "Сначала проведите документ!");
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ПредметыСнабжения.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, "В документе нет ни одного предмета снабжения!");
		Возврат;
		
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Заголовок = "Выберите каталог для формирования файлов:";
	
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("ВыгрузкаТКПЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла", ДиалогВыбораФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаТКПЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		Каталог = ДиалогВыбораФайла.Каталог + "\";
		
		Состояние("Выгрузка файлов в " + Каталог, , БиблиотекаКартинок.ДлительнаяОперация48);
		
		ПараметрыТКП = ПолучитьПараметрыТКП();
		НомерЗапроса = ПараметрыТКП.Получить("<НомерЗапроса>");
		
		ВыгрузитьФайлWord("Контракт_ПисьмоТКПRus", Каталог + НомерЗапроса + " Rus.doc", ПараметрыТКП);
		ВыгрузитьФайлWord("Контракт_ПисьмоТКПEng", Каталог + НомерЗапроса + " Eng.doc", ПараметрыТКП);
		ВыгрузитьФайлExcel(Каталог + НомерЗапроса + " RusEng.xls", ПараметрыТКП);
		
		Сообщить("Завершена выгрузка файлов по адресу " + Каталог);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлWord(ИмяМакета, ИмяФайла, ПараметрыТКП)
	
	ПараметрыПечати = Новый Массив;
	Для Каждого ОписаниеПараметра Из ПараметрыТКП Цикл
		Ключ = СтрЗаменить(СтрЗаменить(ОписаниеПараметра.Ключ,"<",""),">","");
		ПараметрыПечати.Добавить(Новый Структура("Ключ,Значение",Ключ, ОписаниеПараметра.Значение));
	КонецЦикла; // Для Каждого ОписаниеПараметра Из ПараметрыПечати Цикл
	
	ДополнительныеДокументы = Новый Массив;
	ДополнительныеДокументы.Добавить("footer2");
	
	АдресХранилища = РаботаСФайламиOffice.ПодготовитьПисьмоТКПКонтракт(ИмяМакета, ПараметрыПечати, ДополнительныеДокументы);
	
	ДанныеКЗаписи = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ДанныеКЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ДанныеКЗаписи = Неопределено Тогда
	
	Попытка
		ДанныеКЗаписи.Записать(ИмяФайла);
	Исключение
		Сообщить("Не удалось записать файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки(), СтатусСообщения.Важное);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлExcel(ИмяФайла, ПараметрыТКП)
	
	ЗаполнитьТаблицуСпецификацииТКП();
	
	ТабличныйДокумент = РаботаСФайламиOffice.ПодготовитьТабличныйДокументКонтрактПриложение1(СпецификацияТКП, ПараметрыТКП);
	Если ТабличныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли; // Если ТабличныйДокумент = Неопределено Тогда
	
	Попытка
		ТабличныйДокумент.Записать(ИмяФайла);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось сохранить файл " + ИмяФайла + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
//-- 21.02.2018 Веденеев П.

&НаСервере
Процедура ЗаполнитьТаблицуСпецификацииТКП()
	
	СпецификацияТКП.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтрактПредметыСнабжения.Заявка КАК Заявка,
	|	КонтрактПредметыСнабжения.НомерСтроки КАК НомерСтроки,
	|	КонтрактПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	|	КонтрактПредметыСнабжения.Цена КАК Цена,
	|	КонтрактПредметыСнабжения.Количество КАК Количество,
	|	КонтрактПредметыСнабжения.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ втСоставКП
	|ИЗ
	|	Документ.Контракт.ПредметыСнабжения КАК КонтрактПредметыСнабжения
	|ГДЕ
	|	КонтрактПредметыСнабжения.Ссылка = &КоммерческоеПредложение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСнабжения,
	|	Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втСоставКП.Заявка КАК Заявка,
	|	втСоставКП.НомерСтроки КАК НомерСтроки,
	|	втСоставКП.ПредметСнабжения КАК ПредметСнабжения,
	|	втСоставКП.Цена КАК Цена,
	|	втСоставКП.Количество КАК Количество,
	|	втСоставКП.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КаталогПредметовСнабжения.Обозначение + ""/"" + КаталогПредметовСнабжения.ОбозначениеТранслитированное КАК Обозначение,
	|	ЕСТЬNULL(ЗаявкаСпецификация.НомерСтроки, """") КАК НомерСтрокиЗаявки,
	|	КаталогПредметовСнабжения.Наименование КАК Наименование
	|ПОМЕСТИТЬ втТКПБезПереводов
	|ИЗ
	|	втСоставКП КАК втСоставКП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения КАК КаталогПредметовСнабжения
	|		ПО втСоставКП.ПредметСнабжения = КаталогПредметовСнабжения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.Спецификация КАК ЗаявкаСпецификация
	|		ПО втСоставКП.ПредметСнабжения = ЗаявкаСпецификация.ПредметСнабжения
	|			И втСоставКП.Заявка = ЗаявкаСпецификация.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА Контракт.Контрагент ССЫЛКА Справочник.ИностранныеЗаказчики
	|			ТОГДА ВЫРАЗИТЬ(Контракт.Контрагент КАК Справочник.ИностранныеЗаказчики)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИностранныеЗаказчики.ПустаяСсылка)
	|	КОНЕЦ КАК Заказчик
	|ПОМЕСТИТЬ втЗаказчик
	|ИЗ
	|	Документ.Контракт КАК Контракт
	|ГДЕ
	|	Контракт.Ссылка = &КоммерческоеПредложение
	|	И Контракт.Контрагент ССЫЛКА Справочник.ИностранныеЗаказчики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеНаименования.Владелец КАК Владелец,
	|	ДополнительныеНаименования.Перевод КАК Перевод
	|ПОМЕСТИТЬ втПереводыНаименований
	|ИЗ
	|	втЗаказчик КАК втЗаказчик
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИностранныеЗаказчики КАК ИностранныеЗаказчики
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Флоты КАК Флоты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеНаименования КАК ДополнительныеНаименования
	|				ПО Флоты.ЯзыкПредставленияДанных = ДополнительныеНаименования.Язык
	|					И (ДополнительныеНаименования.ИмяРеквизита = ""Наименование"")
	|			ПО ИностранныеЗаказчики.ВМС = Флоты.Ссылка
	|		ПО втЗаказчик.Заказчик = ИностранныеЗаказчики.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТКПБезПереводов.Заявка КАК Заявка,
	|	втТКПБезПереводов.НомерСтроки КАК НомерСтроки,
	|	втТКПБезПереводов.ПредметСнабжения КАК ПредметСнабжения,
	|	втТКПБезПереводов.Цена КАК Цена,
	|	втТКПБезПереводов.Количество КАК Количество,
	|	втТКПБезПереводов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	втТКПБезПереводов.Обозначение КАК Обозначение,
	|	втТКПБезПереводов.НомерСтрокиЗаявки КАК НомерСтрокиЗаявки,
	|	ВЫБОР
	|		КОГДА втПереводыНаименований.Владелец ЕСТЬ NULL
	|			ТОГДА втТКПБезПереводов.Наименование
	|		ИНАЧЕ втТКПБезПереводов.Наименование + ""/"" + втПереводыНаименований.Перевод
	|	КОНЕЦ КАК Наименование
	|ПОМЕСТИТЬ втРезультатБезЕдИзм
	|ИЗ
	|	втТКПБезПереводов КАК втТКПБезПереводов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПереводыНаименований КАК втПереводыНаименований
	|		ПО втТКПБезПереводов.ПредметСнабжения = втПереводыНаименований.Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втРезультатБезЕдИзм.НомерСтроки КАК НомерСтроки,
	|	втРезультатБезЕдИзм.НомерСтрокиЗаявки КАК НомерСтрокиЗаявки,
	|	втРезультатБезЕдИзм.Наименование КАК Наименование,
	|	втРезультатБезЕдИзм.Обозначение КАК Обозначение,
	|	ВЫБОР
	|		КОГДА ОКЕИ.Ссылка ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ОКЕИ.Наименование + ""/"" + ОКЕИ.УсловноеОбозначениеМеждународное
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	втРезультатБезЕдИзм.Цена КАК Цена,
	|	втРезультатБезЕдИзм.Количество КАК Количество,
	|	втРезультатБезЕдИзм.Цена * втРезультатБезЕдИзм.Количество КАК Стоимость
	|ИЗ
	|	втРезультатБезЕдИзм КАК втРезультатБезЕдИзм
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОКЕИ КАК ОКЕИ
	|		ПО втРезультатБезЕдИзм.ЕдиницаИзмерения = ОКЕИ.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	НомерСтрокиЗаявки";
	Запрос.УстановитьПараметр("КоммерческоеПредложение", Объект.Ссылка);
	 
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	СпецификацияТКП.Загрузить(ТаблицаЗапроса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	Возврат Документы.Контракт.ПолучитьМакет(ИмяМакета);
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыТКП()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредметыСнабжения.Заявка КАК Заявка
	|ПОМЕСТИТЬ втЗаявки
	|ИЗ
	|	&ПредметыСнабжения КАК ПредметыСнабжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	докЗаявка.Номер КАК Номер,
	|	ЗапросТКП.Ссылка КАК ЗапросТКП
	|ИЗ
	|	втЗаявки КАК втЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК докЗаявка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗапросТКПRFP КАК ЗапросТКП
	|			ПО докЗаявка.ЗапросТКПRFP = ЗапросТКП.Ссылка
	|		ПО втЗаявки.Заявка = докЗаявка.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(ЗапросТКП)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("ПредметыСнабжения", Объект.ПредметыСнабжения.Выгрузить());
	
	ВыборкаИтого = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивЗаявок = Новый Массив;
	
	Пока ВыборкаИтого.Следующий() Цикл
		
		ЗапросТКП = ВыборкаИтого.ЗапросТКП;
		
		Выборка = ВыборкаИтого.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МассивЗаявок.Добавить(Выборка.Номер);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	КонтрагентИнозаказчик = (ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ИностранныеЗаказчики"));
	
	ПараметрыТКП = Новый Соответствие;
	ПараметрыТКП.Вставить("<НаименованиеИностранногоЗаказчика>", Строка(Объект.Контрагент));
	ПараметрыТКП.Вставить("<НомерЗапроса>", ЗапросТКП.Номер);
	ПараметрыТКП.Вставить("<ДатаЗапроса>", Формат(ЗапросТКП.Дата, "ДЛФ=DD"));
	ПараметрыТКП.Вставить("<ДатаЗапросаАнгл>", ФорматДатыАнгл(ЗапросТКП.Дата));
	ПараметрыТКП.Вставить("<НомерЗаявки>", СтрСоединить(МассивЗаявок, ", "));
	ПараметрыТКП.Вставить("<СрокПоставкиМес>", Формат(Окр(ЗапросТКП.СрокПоставки / 30, 0, РежимОкругления.Окр15как20), "ЧН=; ЧГ=0"));
	ПараметрыТКП.Вставить("<СрокДействияКП>", Объект.СрокДействияКП);
	ПараметрыТКП.Вставить("<ГодДействияЦен>", Формат(Год(Объект.СрокДействияКП), "ЧН=; ЧГ=0"));
	ПараметрыТКП.Вставить("<ДолжностьСоставителя>", ТекущийПользователь.Должность);
	ПараметрыТКП.Вставить("<ДолжностьСоставителяАнгл>", ТекущийПользователь.ДолжностьАнгл);
	ПараметрыТКП.Вставить("<ФИОСоставителя>", ТекущийПользователь.Наименование);
	ПараметрыТКП.Вставить("<ФИОСоставителяАнгл>", ТекущийПользователь.НаименованиеАнгл);
	ПараметрыТКП.Вставить("<АдресИностранногоЗаказчика>", ?(КонтрагентИнозаказчик, Строка(Объект.Контрагент.ПолныйАдрес), ""));
	ПараметрыТКП.Вставить("<Страна>", ?(КонтрагентИнозаказчик, Строка(Объект.Контрагент.ВМС.Страна), ""));
	ПараметрыТКП.Вставить("<ДолжностьИмяКонтактногоЛица>", 
		?(КонтрагентИнозаказчик, Объект.Контрагент.ДолжностьРуководителя + " " +Объект.Контрагент.ФИОРуководителя, ""));
	
	Возврат ПараметрыТКП;
	
КонецФункции

&НаСервере
Функция ФорматДатыАнгл(ИсходнаяДата)
	
	СоответствиеМесяцев = Новый Соответствие;
	СоответствиеМесяцев.Вставить(1, "January");
	СоответствиеМесяцев.Вставить(2, "February");
	СоответствиеМесяцев.Вставить(3, "March");
	СоответствиеМесяцев.Вставить(4, "April");
	СоответствиеМесяцев.Вставить(5, "May");
	СоответствиеМесяцев.Вставить(6, "June");
	СоответствиеМесяцев.Вставить(7, "July");
	СоответствиеМесяцев.Вставить(8, "August");
	СоответствиеМесяцев.Вставить(9, "September");
	СоответствиеМесяцев.Вставить(10, "October");
	СоответствиеМесяцев.Вставить(11, "November");
	СоответствиеМесяцев.Вставить(12, "December");
	
	ДатаСтрокой = Строка(День(ИсходнаяДата)) + " " + СоответствиеМесяцев.Получить(Месяц(ИсходнаяДата)) + " " + Прав(Формат(Год(ИсходнаяДата), "ЧГ=0"), 2);
	
	Возврат ДатаСтрокой;
	
КонецФункции

// ++ 21.09.2018 9:37:46 Базунов Д.А. Задача: 

&НаКлиенте
Процедура ЗаполнитьСрокПоставки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПоказаВопроса", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, "Установить во всех строках срок поставки?",РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПоказаВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаЧисла", ЭтотОбъект, Параметры);
		
		ПоказатьВводЧисла(Оповещение, 1, "", 3, 0);
		
	КонецЕсли; 

КонецПроцедуры
  
&НаКлиенте
Процедура ПослеВводаЧисла(Число, Параметры) Экспорт
	
	Если НЕ Число = Неопределено Тогда
        
		ПроставитьСрокПоставки(Число);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроставитьСрокПоставки(СрокПоставки)
	
	Для каждого ТекСтрока Из Объект.ПредметыСнабжения Цикл
		
		ТекСтрока.СрокПоставки = СрокПоставки;
		
	КонецЦикла; 
	
КонецПроцедуры

// -- 21.09.2018 9:37:56 Базунов Д.А. Задача: 

#КонецОбласти

&НаКлиенте
Процедура ПоказатьСкрытьТендерныеЦены(Команда)
	Если Элементы.ГруппаТендерныеЦены.Видимость Тогда
		
		Элементы.ГруппаТендерныеЦены.Видимость = Ложь;
		Элементы.ПредметыСнабженияПоказатьСкрытьТендерныеЦены.Пометка = Ложь;
		
	Иначе
		
		ОтобразитьЦены("ЦеныТендерные");
		Элементы.ГруппаТендерныеЦены.Видимость = Истина;
		Элементы.ПредметыСнабженияПоказатьСкрытьТендерныеЦены.Пометка = Истина;
		
	КонецЕсли;
КонецПроцедуры

#Область ЗагрузкаПредметовСнабженияИзExcel

#Область ВспомогательныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьЗагрузчикПредметовСнабжения()
	
	ПараметрыОткрытия  = Новый Структура("ДокументКонтракт", Объект.Ссылка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиПредметовСнабжения", ЭтаФорма);
	
	ОткрытьФорму("Документ.Контракт.Форма.ЗагрузкиПредметовСнабженияИзExcel",
					ПараметрыОткрытия,
					ЭтаФорма,
					ЭтаФорма.УникальныйИдентификатор,,,
					ОписаниеОповещения);
	
КонецПроцедуры // ОткрытьЗагрузчикПредметовСнабжения

&НаСервере
Процедура ЗагрузитьПредметыСнабженияИзВременногоХранилища(АдресВременногоХранилища)
	Объект.ПредметыСнабжения.Загрузить(ПолучитьИзВременногоХранилища(АдресВременногоХранилища));	
КонецПроцедуры // ЗагрузитьПредметыСнабженияИзВременногоХранилища

#КонецОбласти

#Область CallBackМетоды

&НаКлиенте
Процедура ПослеЗагрузкиПредметовСнабжения(Результат, ДополнительныеПараметры) Экспорт
	Элементы.ПредметыСнабжения.Обновить();
КонецПроцедуры // ПослеЗагрузкиПредметовСнабжения

&НаКлиенте
Процедура ПослеВопросаОСохранении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Записать();
		
		Если Объект.ПредметыСнабжения.Количество() > 0 Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОбОчистке", ЭтаФорма);
			ПоказатьВопрос(ОписаниеОповещения, "Табличная часть предметов снабжения будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет,30, КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет);
		Иначе
			ОткрытьЗагрузчикПредметовСнабжения();	
		КонецЕсли; // Если Объект.ПредметыСнабжения.Количество() > 0 Тогда
		
	КонецЕсли; // Если Результат = КодВозвратаДиалога.Да Тогда
	
КонецПроцедуры // ПослеВопросаОСохранении

&НаКлиенте
Процедура ПослеВопросаОбОчистке(Результат, ДополнительынеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОткрытьЗагрузчикПредметовСнабжения();
	КонецЕсли; // Если Результат = КодВозвратаДиалога.Да Тогда
КонецПроцедуры // ПослеВопросаОбОчистке

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КомандаЗагрузитьПредметыСнабжения(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСохранении", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Для загрузки нужно сохранить документ, сохранить и продолжить?", РежимДиалогаВопрос.ДаНет,30,КодВозвратаДиалога.Нет,,КодВозвратаДиалога.Нет);
	Иначе
		ПослеВопросаОСохранении(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли; // Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
КонецПроцедуры // КомандаЗагрузитьПредметыСнабжения

#КонецОбласти

#Область СобытияФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗагрузитьПредметыСнабженияКонтракт" Тогда
		ЗагрузитьПредметыСнабженияИзВременногоХранилища(Параметр);
	КонецЕсли; // Если ИмяСобытия = "ЗагрузитьПредметыСнабженияКонтракт" Тогда
КонецПроцедуры // ОбработкаОповещения

#КонецОбласти

#КонецОбласти
